{
  "navbar": {
    "about": "About me",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "greeting": "Hi, I'm",
    "description": "Developer passionate about technology, cybersecurity, and software development.",
    "techTitle": "Technologies and tools I master",
    "languages": "Programming Languages",
    "frameworks": "Frameworks and Libraries",
    "tools": "Tools and Environments",
    "aboutMeTitle": "About Me",
    "aboutMe": "I'm a web developer passionate about technological innovation and continuous learning. I enjoy working on creative and functional projects, focusing on detail and delivering unique user experiences. When I'm not coding, I explore cybersecurity and new web tools.",
    "aboutMeNote": "Passionate about coffee and web development ☕"
  },
  "projects": {
    "title": "My Projects",
    "technologiesUsed": "Technologies used:",
    "viewProject": "View the project in action",
    "tareku": {
      "description": "Tareku is a web application designed to manage tasks efficiently. It allows users to create, organize, and view tasks with deadlines, prioritizing them by urgency. Its intuitive and modern interface makes time management easier, helping users boost their productivity."
    },
    "imh4nnyhub": {
      "description": "A visually appealing platform that centralizes links to social media and donation options in one place. With an animated interface and dynamic effects, it offers followers a smooth and accessible experience."
    },
    "portfolio": {
      "description": "This is my personal portfolio, a modern and dynamic website showcasing my projects, skills, and experience. It features smooth animations and advanced visual effects for an attractive and interactive experience."
    },
    "imh4nnyhupdate": {
      "description": "The new version of IMH4NNY HUB represents a significant improvement in design, interactivity, and usability. It now offers an even more dynamic and attractive interface with better layout for a smoother user experience."
    },
    "scientistcalc": {
      "description": "An intuitive web calculator capable of performing both basic and scientific operations, including long expressions with visible history. Its responsive and modern design enhances user experience with horizontal scroll, result rounding, and error handling."
    },
    "clocks-international-timezones": {
      "description": "A web application that displays the current time across different regions of the world, with a dynamic design, smooth animations, and a light/dark mode toggle. Users can select regions, customize the view, and enjoy an interactive animated background."
    }
  },
  "contact": {
    "title": "Contact Me",
    "description": "Send me a message and I’ll reply as soon as possible.",
    "location": "Cúcuta, Norte de Santander – Colombia",
    "nameLabel": "Name",
    "placeholderName": "Your Name",
    "emailLabel": "Email",
    "placeholderEmail": "Your Email",
    "messageLabel": "Message",
    "placeholderMessage": "Write your message here...",
    "send": "Send",
    "sending": "Sending...",
    "success": "Message sent successfully ✅",
    "error": "Failed to send the message ❌",
    "serverError": "Server connection error ❌",
    "linkedin": "LinkedIn",
    "github": "GitHub"
  },
  "meta": {
    "inicio": {
      "title": "Home | Iván Andrés - Portfolio",
      "description": "Welcome to Iván Andrés' portfolio. Discover creative projects with React, Node.js, and innovative design."
    },
    "proyectos": {
      "title": "Projects | Iván Andrés - Portfolio",
      "description": "Explore a collection of projects developed by Iván Andrés, using modern technologies and great design."
    },
    "contacto": {
      "title": "Contact | Iván Andrés - Portfolio",
      "description": "Want to work with me or have a proposal? Get in touch with Iván Andrés through the form or social media."
    }
  }
}
