{
  "navbar": {
    "about": "Обо мне",
    "projects": "Проекты",
    "contact": "Контакты"
  },
  "home": {
    "greeting": "Привет, я",
    "description": "Разработчик, увлечённый технологиями, кибербезопасностью и программной разработкой.",
    "techTitle": "Технологии и инструменты, которыми я владею",
    "languages": "Языки программирования",
    "frameworks": "Фреймворки и библиотеки",
    "tools": "Инструменты и среды"
  },
  "projects": {
    "title": "Мои проекты",
    "technologiesUsed": "Используемые технологии:",
    "viewProject": "Посмотреть проект в действии",
    "tareku": {
      "description": "Tareku — это веб-приложение, созданное для эффективного управления задачами. Оно позволяет создавать, организовывать и просматривать задачи с дедлайнами, а также расставлять их приоритет по степени срочности. Интуитивный и современный интерфейс упрощает управление временем и помогает пользователям повысить продуктивность."
    },
    "imh4nnyhub": {
      "description": "Визуально привлекательная платформа, централизующая ссылки на соцсети и опции пожертвования в одном месте. С анимированным интерфейсом и динамическими эффектами она предлагает подписчикам плавный и доступный опыт."
    },
    "portfolio": {
      "description": "Это мой веб-портфолио — современный и динамичный сайт, на котором я демонстрирую свои проекты, навыки и опыт. Он реализует плавные анимации и продвинутые визуальные эффекты для привлекательного и интерактивного опыта."
    },
    "imh4nnyhupdate": {
      "description": "Новая версия IMH4NNY HUB представляет собой значительное улучшение в дизайне, интерактивности и удобстве использования. Теперь с ещё более динамичным и привлекательным интерфейсом и улучшенным расположением элементов для более плавного пользовательского опыта."
    },
    "scientistcalc": {
      "description": "Интуитивный веб-калькулятор, способный выполнять базовые и научные операции, включая длинные выражения с видимой историей. Его адаптивный и современный дизайн улучшает пользовательский опыт, включая горизонтальную прокрутку, округление результатов и обработку ошибок."
    },
    "clocks-international-timezones": {
      "description": "Веб-приложение, показывающее текущее время в различных часовых поясах мира, с динамичным дизайном, плавной анимацией и опцией светлого/тёмного режима. Позволяет пользователю выбирать регионы, настраивать отображение и наслаждаться интерактивным анимированным фоном."
    }
  },
  "contact": {
    "title": "Свяжитесь со мной",
    "description": "Отправьте мне сообщение, и я отвечу как можно скорее.",
    "location": "Cúcuta, Norte de Santander – Colombia",
    "nameLabel": "Имя",
    "placeholderName": "Ваше имя",
    "emailLabel": "Электронная почта",
    "placeholderEmail": "Ваша почта",
    "messageLabel": "Сообщение",
    "placeholderMessage": "Напишите ваше сообщение здесь...",
    "send": "Отправить",
    "sending": "Отправка...",
    "success": "Сообщение успешно отправлено ✅",
    "error": "Ошибка при отправке сообщения ❌",
    "serverError": "Ошибка подключения к серверу ❌",
    "linkedin": "LinkedIn",
    "github": "GitHub"
  },
  "meta": {
    "inicio": {
      "title": "Главная | Iván Andrés - Портфолио",
      "description": "Добро пожаловать в портфолио Iván Andrés. Откройте для себя творческие проекты с React, Node.js и инновационным дизайном."
    },
    "proyectos": {
      "title": "Проекты | Iván Andrés - Портфолио",
      "description": "Изучите коллекцию проектов, разработанных Iván Andrés с использованием современных технологий и продуманного дизайна."
    },
    "contacto": {
      "title": "Контакты | Iván Andrés - Портфолио",
      "description": "Хотите работать со мной или есть предложение? Свяжитесь с Iván Andrés через форму или соцсети."
    }
  }
}
